/*
Вы должны принимать по одной таблетке лекарства А и лекарства Б один раз в день. 
A, и B выглядят одинаково, и когда их вынимают из упаковки, они неразличимы.
Однажды, в субботу, вы запутались в таблетках. 
У вас в руке 1 таблетка А и 2 таблетки Б, но вы не можете их различить. 
Помимо этого, в упаковке из-под таблеток А осталась одна таблетка.
Как вам дождаться открытия аптеки в понедельник, не нарушив дозировку?

Два варианта решения:
1) Без риска. Добавить вторую пелюлю из банки. Растолоч 4 пилюли в порошок. 
    Равномерно смешать их. Выделить полоину и выпить. 
2) С риском. Случайно выбрать две пелюли из трех. Вероятность что попадется 
    две разные пелюлю 83%(как получились такие данные, когда первый раз вытаскиваешь то вероятность вытащить пилюлю А - 1/3, 
    второй раз - 1/2, перемножаем вероятности 1/3*1/2 = 5/6 = 0,83). Выпить. Затем вытащить пилюли из 1 банки и выпить с 
    оставшейся пилюлей.
 */