/*
Перед вами на рисунке 4 карточки. 
На каждой карточке написано число с одной стороны и буква с другой. 
Вам сказали, что на каждой карточке, где с одной стороны гласная буква, 
с противоположной стороны написано четное число.
Сколько карточек (и какие именно) вам нужно перевернуть, 
чтобы проверить истинность этого утверждения?
 */
/*
Решение:
    Утверждение: Все карты на "рубашке", которых изображена гласная буква
                имеют четное число на обратной стороне.
    Чтобы опровергнуть это решение досточно одного правального эксперимента.
    Чтобы подтвердить необходимо, чтобы все карты, которые находятся на столе это подтверждали.

    Чтобы подтвердить истинность этого суждения необходимо перевернуть 2 карты:
        1) Cart A - на обратной стороне должна быть четная цифра
        2) Cart C - на обратной стороне должна быть гласная буква
*/
Console.WriteLine("Hello, World!");
