/*
 Перед вами на рисунке 4 карточки. 
 На каждой карточке написано число с одной стороны и буква с другой. 
 Вам сказали, что на каждой карточке, где с одной стороны гласная буква, 
 с противоположной стороны написано четное число.
 Сколько карточек (и какие именно) вам нужно перевернуть, 
 чтобы проверить истинность этого утверждения? 
*/
/*
 Решение:
    Чтобы опровергнуть утверждение необходимо, чтобы хотя бы под 
    одной из карт на рубашке, которой была бы гласна, оказалось нечетное число.
    Поэтому необходимо проверить две карты:
        Card A - перевернуть, на обратной стороне должно быть четное число.
        Card C - перевернуть, на обратной стороне должна быть гласна буква.
 */


Console.WriteLine("Hello, World!");
